
/*++

Copyright (c) Microsoft Corporation.  All rights reserved.

    THIS CODE AND INFORMATION IS PROVIDED "AS IS" WITHOUT WARRANTY OF ANY
    KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND/OR FITNESS FOR A PARTICULAR
    PURPOSE.

Module Name:

    pl061.c

Abstract:

    This sample implements a GPIO client driver for Pl061 GPIO
    controller.

    Note: DIRQL in the comments below refers to device IRQL, which is any
        IRQL > DISPATCH_LEVEL (and less than some IRQL reserved for OS use).


Environment:

    Kernel mode

--*/

//
// The Pl061 controller has 4 GPIO banks, with banks consisting of
// 32 pins each. Any pin can be configured for interrupt, input or output.
// Each bank has the the following registers. The register set for different
// banks are laid out adjacent to one another in the physical memory map.
//
//      Register        |   Offset      |   Size
// ------------------------------------------------
// ModeRegister         |    0x0        |   4 bytes
// PolarityRegister     |    0x4        |   8 bytes
// EnableRegister       |    0xC        |   4 bytes
// StatusRegister       |    0x10       |   4 bytes
// DirectionRegister    |    0x14       |   4 bytes
// LevelRegister        |    0x18       |   4 bytes
//
// Mode Register - Interrupt mode (Level = 0x1 or Edge = 0x0) for pins
//      enabled for interrupts.
//
// Polarity Register - ActiveLow (0x0) or ActiveHigh (0x1) for Level-triggered
//      interrupts; Falling-edge (0x0), Rising-edge (0x1), or Both-Edges (0x3)
//      for Edge-triggered interrupts. Note there are two bits per pin.
//
// Enable Register - A mask of which pins are enabled for interrupt. A bit
//      is set if the pin is enabled for interrupt.
//
// Status Register - A register containing which pins are actively interrupting.
//      If any of the bit is set, then the GPIO controller's interrupt fires.
//
// Direction Register - A register which indicates whether a given pin is
//      configured for input (0x1) or output (0x0).
//
// LevelRegister - A bitmask which indicates holds the value for a given pin
//      (i.e. whether the pin is high (0x1) or low (0x0)).
//

//
// ------------------------------------------------------------------- Includes
//

#include <ntddk.h>
#include <wdf.h>
#include <gpioclx.h>
#include "trace.h"
#include "pl061gpio.tmh"

//
// -------------------------------------------------------------------- Defines
//

//
// Define total number of pins on the Pl061 GPIO controller.
//

#define PL061_GPIO_TOTAL_PINS (8)
#define PL061_GPIO_PINS_PER_BANK (8)
#define PL061_GPIO_TOTAL_BANKS (1)

//
// Pool tag for Pl061 allocations.
//

#define PL061_GPIO_POOL_TAG '16LP'

//
// Define that controls whether f-state based power management will be supported
// or not by the client driver.
//

#define ENABLE_F_STATE_POWER_MGMT

//
// Define F1 state residency (in sec), latency values (in sec) and nominal
// power.
//
// This sample demonstrates F-state management effected as part of a critical
// system transition (when the system enters connected-standby). To prevent a
// GPIO bank from being transitioned into a low power state as part of runtime
// idle power management (by mini-PEP), specify very high values for residency
// and transition latency.
//
// If GPIO banks need to be runtime power managed, then specify more reasonable
// values below.
//

#ifdef ENABLE_F_STATE_POWER_MGMT

#define PL061_GPIO_F1_NOMINAL_POWER (0)
#define PL061_GPIO_F1_RESIDENCY (8 * 60 * 60)  // 8hrs
#define PL061_GPIO_F1_TRANSITION (1 * 60 * 60) // 1hr

#endif

//
// Macro for pointer arithmetic.
//

#define Add2Ptr(Ptr, Value) ((PVOID)((PUCHAR)(Ptr) + (Value)))

//
// Determine whether the given pin is reserved or not. Currently no pins are
// reserved on the Pl061 GPIO controller.
//

__pragma(warning(disable : 4127)) // conditional expression is a constant

    //
    // ---------------------------------------------------------------------- Types
    //

    //
    // Define the registers within the PL061 controller. There are 32 pins per
    // controller. Note this is a logical device and thus may correspond to a
    // physical bank or module if the GPIO controller in hardware has more than
    // 32 pins.
    //

    typedef struct _PL061_GPIO_REGISTERS
{
    // ARM PL061 GPIO controller actual hardware register layout.
    // The PL061 registers are at specific offsets and should not be accessed
    // sequentially as the gpio simulation did.
    // We define only the registers we use and handle offsets explicitly.
    ULONG GPIODATA;          // @ 0x000-0x3FC (8 offset for each pin)
    ULONG padding1[256 - 1]; // Padding to 0x400
    ULONG GPIODIR;           // @ 0x400 (direction: 1=output, 0=input)
    ULONG GPIOIS;            // @ 0x404 (interrupt sense: 1=level, 0=edge)
    ULONG GPIOIBE;           // @ 0x408 (both edges: 1=both, 0=single)
    ULONG GPIOIEV;           // @ 0x40C (interrupt event: 1=rising/high, 0=falling/low)
    ULONG GPIOIE;            // @ 0x410 (interrupt enable)
    ULONG GPIORIS;           // @ 0x414 (raw interrupt status)
    ULONG GPIOMIS;           // @ 0x418 (masked interrupt status, read-only)
    ULONG GPIOIC;            // @ 0x41C (interrupt clear, write-1-to-clear)
    ULONG GPIOCR;            // @ 0x420 (commit register)
} PL061_GPIO_REGISTERS, *PPL061_GPIO_REGISTERS;

typedef struct _PL061_GPIO_BANK
{
    LARGE_INTEGER PhysicalBaseAddress;
    PPL061_GPIO_REGISTERS Registers;
    ULONG Length;
    PL061_GPIO_REGISTERS SavedContext;
} PL061_GPIO_BANK, *PPL061_GPIO_BANK;

//
// The PL061 client driver device extension.
//

typedef struct _PL061_GPIO_CONTEXT
{
    USHORT TotalPins;
    LARGE_INTEGER PhysicalBaseAddress;
    PPL061_GPIO_REGISTERS ControllerBase;
    ULONG Length;
    PL061_GPIO_BANK Banks[PL061_GPIO_TOTAL_BANKS];
} PL061_GPIO_CONTEXT, *PPL061_GPIO_CONTEXT;

PL061_GPIO_REGISTERS GlobalGpioRegisters[PL061_GPIO_TOTAL_BANKS] = {0};

//
// ----------------------------------------------------------------- Prototypes
//

DRIVER_INITIALIZE DriverEntry;

EVT_WDF_DRIVER_UNLOAD Pl061EvtDriverUnload;
EVT_WDF_DRIVER_DEVICE_ADD Pl061EvtDeviceAdd;

//
// General interfaces.
//

GPIO_CLIENT_PREPARE_CONTROLLER Pl061PrepareController;
